orderPricePlan/templates/payloads/QueryCustomerInfo.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bcs="http://172.22.26.40:8080/services/BcServices " xmlns:cbs="http://www.huawei.com/bme/cbsinterface/cbscommon" xmlns:bcc="http://www.huawei.com/bme/cbsinterface/bccommon">
   <soapenv:Header/>
   <soapenv:Body>
      <bcs:QueryCustomerInfoRequestMsg>
         <RequestHeader>
            <cbs:Version>1</cbs:Version>
            <!--Optional:-->
            <cbs:BusinessCode>QueryCustomerInfoRequest</cbs:BusinessCode>
            <cbs:MessageSeq>${=new java.text.SimpleDateFormat("yyyy-MM-dd'T'HH:mm:ss.SSS").format(new Date())}</cbs:MessageSeq>
            <!--Optional:-->
            <cbs:OwnershipInfo>
               <cbs:BEID>101</cbs:BEID>
            </cbs:OwnershipInfo>
             <cbs:AccessSecurity>
                <cbs:LoginSystemCode>102</cbs:LoginSystemCode>
                <cbs:Password>7/PuyYwNpRtSX7jDpxnl2ECAvuVYH2Mu9zxqgPGJrPYYK73MCZN7DvrDepA=</cbs:Password>
            </cbs:AccessSecurity>
           
         </RequestHeader>
         <QueryCustomerInfoRequest>
            <bcs:QueryObj>
               <bcs:SubAccessCode>
                  <bcc:PrimaryIdentity>9210451762</bcc:PrimaryIdentity>
               </bcs:SubAccessCode>
            </bcs:QueryObj>
         </QueryCustomerInfoRequest>
      </bcs:QueryCustomerInfoRequestMsg>
   </soapenv:Body>
</soapenv:Envelope>